app/Services/QueueService.php

    public static function _expQueueInstance($id)
    {
        return ExperimentQueue::where([
            'experiment_id' => $id,
            'user_id' => auth()->user()->id
        ])->first();
---
select * from `experiment_queues` where (`experiment_id` = 2 and `user_id` = 1) limit 1

    public static function _addQueue(ExperimentQueue $eq, $username, $timeStart)
    {
        $experiment = Experiment::where('id', $eq->experiment_id)->first();
---
select * from `experiments` where `id` = '4' limit 1

    public static function _timeStart(ExperimentQueue $eq)
    {
        $firstModel = ExperimentQueue::where(
            'experiment_id',
            $eq->experiment_id
        )->first();
---
select * from `experiment_queues` where `experiment_id` = '4' limit 1