app/Http/Controllers/Arduino/DescriptionController.php

insert into `experiment_queues` (`user_id`, `experiment_id`, `updated_at`, `created_at`) values ('21', '2', '2021-05-06 22:21:21', '2021-05-06 22:21:21')
---
    public function registerForExp(Request $request)
    {
        try {
            $model = new ExperimentQueue;
            $model->user_id = $request->user_id;
            $model->experiment_id = $request->exp_id;

            $model->save();

select * from `experiment_queues` where (`experiment_id` = 1 and `user_id` = 21) limit 1
---
    protected function _expQueueInstance($id)
    {
        return ExperimentQueue::where([
            'experiment_id' => $id,
            'user_id' => auth()->user()->id
        ])->first();

select * from `experiments` where `id` = '2' limit 1
---
    protected function _addQueue(ExperimentQueue $eq, $username)
    {
        $timeStart = $this->_timeStart($eq);
        $experiment = Experiment::where('id', $eq->experiment_id)->first();

select * from `experiment_queues` where `experiment_id` = '2' limit 1
---
    protected function _timeStart(ExperimentQueue $eq)
    {
        $firstModel = ExperimentQueue::where(
            'experiment_id',
            $eq->experiment_id
        )->first();