app/Services/Experiment/Menu.php

    public function getCountQueue()
    {
<<<<<<< Updated upstream
        $queue['distance'] = ExperimentQueue::where(['experiment_id' => 1, 'status' => 0])->count();
        $queue['servo'] = ExperimentQueue::where(['experiment_id' => 2, 'status' => 0])->count();
        $queue['led'] = ExperimentQueue::where(['experiment_id' => 3, 'status' => 0])->count();
        $queue['display'] = ExperimentQueue::where(['experiment_id' => 4, 'status' => 0])->count();
=======
        $queue['distance'] = ExperimentQueue::where(['experiment_id' => self::DISTANCE, 'status' => self::DISABLE])->count();
        $queue['servo'] = ExperimentQueue::where(['experiment_id' => self::SERVO, 'status' => self::DISABLE])->count();
        $queue['led'] = ExperimentQueue::where(['experiment_id' => self::LED, 'status' => self::DISABLE])->count();
        $queue['display'] = ExperimentQueue::where(['experiment_id' => self::DISPLAY, 'status' => self::DISABLE])->count();
---
select count(*) as aggregate from `experiment_queues` where (`experiment_id` = 4 and `status` = 0)
select * from `experiment_queues` where (`experiment_id` = 3 and `status` = 1) limit 1
select * from `experiment_queues` where (`experiment_id` = 1 and `status` = 1) limit 1
select * from `experiment_queues` where (`experiment_id` = 4 and `status` = 1) limit 1

    public function getTimeQueue()
    {
<<<<<<< Updated upstream
        $result = ExperimentQueue::where(['experiment_id' => 1, 'status' => 1])->first();
---
select * from `experiment_queues` where (`experiment_id` = 4 and `status` = 1) limit 1